In [29]:
import pandas as pd
import numpy as np
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [30]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [31]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [32]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [33]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [34]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [35]:
 inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [36]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [37]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [38]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [39]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [40]:
model.fit(X_train, y_train)

GaussianNB()

In [41]:
model.score(X_test, y_test)

0.7723880597014925

In [46]:
X_test[0:10]

     Pclass        Age      Fare  female
659       1  58.000000  113.2750       0
3         1  35.000000   53.1000       1
856       1  45.000000  164.8667       1
640       3  20.000000    7.8542       0
863       3  29.699118   69.5500       1
38        3  18.000000   18.0000       1
405       2  34.000000   21.0000       0
403       3  28.000000   15.8500       0
824       3   2.000000   39.6875       0
688       3  18.000000    7.7958       0

In [47]:
y_test[0:10]

659    0
3      1
856    1
640    0
863    0
38     0
405    0
403    0
824    0
688    0
Name: Survived, dtype: int64

In [44]:
model.predict(X_test[:10])

array([1, 1, 1, 0, 1, 1, 0, 0, 0, 0], dtype=int64)

In [45]:
model.predict_proba(X_test[0:10])

array([[8.09034666e-02, 9.19096533e-01],
       [5.88532643e-02, 9.41146736e-01],
       [1.36520222e-05, 9.99986348e-01],
       [9.58004686e-01, 4.19953135e-02],
       [1.88364536e-01, 8.11635464e-01],
       [3.88276802e-01, 6.11723198e-01],
       [9.30729982e-01, 6.92700181e-02],
       [9.63754958e-01, 3.62450416e-02],
       [9.22592912e-01, 7.74070882e-02],
       [9.56413389e-01, 4.35866111e-02]])